Revit 2027 API
ParameterTypeId.AnalyticalNodeType Property
 "Node Type": Specifies the type of the Analytical Node: hosted or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalNodeType { get; }
Public Shared ReadOnly Property AnalyticalNodeType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalNodeType {
	ForgeTypeId^ get ();
}
static member AnalyticalNodeType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace